package com.fixmer.mared.gui2.modules.theme;


/**
 * Основные разделы MaRed Studio.
 *
 * Каждый модуль имеет:
 *
 * - собственный цвет;
 * - своё назначение;
 * - свои панели;
 * - свои инструменты.
 */
public enum ModuleType {


    /**
     * Предметы, блоки, сущности,
     * NPC, модели, анимации,
     * рецепты, квесты, UI.
     */
    CONTENT,



    /**
     * Генерация мира,
     * измерения, структуры,
     * погода, экосистема.
     */
    WORLD,



    /**
     * Скрипты,
     * события,
     * триггеры,
     * логика поведения.
     */
    LOGIC,



    /**
     * Ассеты,
     * ресурспаки,
     * локализация,
     * шейдеры.
     */
    RESOURCES,



    /**
     * Отладка,
     * профилировщик,
     * тестирование,
     * API.
     */
    TOOLS,



    /**
     * Кампания,
     * сюжет,
     * мини-игры,
     * игровые сценарии.
     */
    GAMEPLAY


}